logs/limits/dataplane-probe-activator-5.log
dataplane-probe-activator-c8prt dataplane-probe {"level":"info","ts":1693556026.1009243,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
dataplane-probe-activator-c8prt dataplane-probe 2023/09/01 08:13:46 Starting dataplane probe for target: activator
dataplane-probe-activator-f5vx6 dataplane-probe {"level":"info","ts":1693556026.161364,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
dataplane-probe-activator-f5vx6 dataplane-probe 2023/09/01 08:13:46 Starting dataplane probe for target: activator
dataplane-probe-activator-k4lld dataplane-probe {"level":"info","ts":1693556026.5978975,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
dataplane-probe-activator-k4lld dataplane-probe 2023/09/01 08:13:46 Starting dataplane probe for target: activator
dataplane-probe-activator-h8p9k dataplane-probe {"level":"info","ts":1693556026.8952622,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
dataplane-probe-activator-h8p9k dataplane-probe 2023/09/01 08:13:47 Starting dataplane probe for target: activator
dataplane-probe-activator-drcwb dataplane-probe {"level":"info","ts":1693556030.5632482,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
dataplane-probe-activator-drcwb dataplane-probe 2023/09/01 08:13:50 Starting dataplane probe for target: activator
dataplane-probe-activator-c8prt dataplane-probe Requests      [total, rate, throughput]         180000, 1000.00, 999.44
dataplane-probe-activator-c8prt dataplane-probe Duration      [total, attack, wait]             3m0s, 3m0s, 102.129ms
dataplane-probe-activator-c8prt dataplane-probe Latencies     [min, mean, 50, 90, 95, 99, max]  100.85ms, 102.667ms, 102.325ms, 103.005ms, 103.208ms, 105.758ms, 1.191s
dataplane-probe-activator-c8prt dataplane-probe Bytes In      [total, mean]                     4299935, 23.89
dataplane-probe-activator-c8prt dataplane-probe Bytes Out     [total, mean]                     0, 0.00
dataplane-probe-activator-c8prt dataplane-probe Success       [ratio]                           100.00%
dataplane-probe-activator-c8prt dataplane-probe Status Codes  [code:count]                      200:180000  
dataplane-probe-activator-c8prt dataplane-probe Error Set:
dataplane-probe-activator-c8prt dataplane-probe 2023/09/01 08:16:46 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
dataplane-probe-activator-c8prt dataplane-probe 2023/09/01 08:16:46 Dataplane probe test finished
dataplane-probe-activator-c8prt dataplane-probe 2023/09/01 08:16:46 Shutting down InfluxReporter
dataplane-probe-activator-f5vx6 dataplane-probe Requests      [total, rate, throughput]         180000, 1000.00, 999.44
dataplane-probe-activator-f5vx6 dataplane-probe Duration      [total, attack, wait]             3m0s, 3m0s, 102.307ms
dataplane-probe-activator-f5vx6 dataplane-probe Latencies     [min, mean, 50, 90, 95, 99, max]  100.795ms, 102.685ms, 102.313ms, 103.01ms, 103.239ms, 107.949ms, 1.281s
dataplane-probe-activator-f5vx6 dataplane-probe Bytes In      [total, mean]                     4300060, 23.89
dataplane-probe-activator-f5vx6 dataplane-probe Bytes Out     [total, mean]                     0, 0.00
dataplane-probe-activator-f5vx6 dataplane-probe Success       [ratio]                           100.00%
dataplane-probe-activator-f5vx6 dataplane-probe Status Codes  [code:count]                      200:180000  
dataplane-probe-activator-f5vx6 dataplane-probe Error Set:
dataplane-probe-activator-f5vx6 dataplane-probe 2023/09/01 08:16:46 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
dataplane-probe-activator-f5vx6 dataplane-probe 2023/09/01 08:16:46 Dataplane probe test finished
dataplane-probe-activator-f5vx6 dataplane-probe 2023/09/01 08:16:46 Shutting down InfluxReporter
dataplane-probe-activator-k4lld dataplane-probe Requests      [total, rate, throughput]         180000, 1000.00, 999.43
dataplane-probe-activator-k4lld dataplane-probe Duration      [total, attack, wait]             3m0s, 3m0s, 102.84ms
dataplane-probe-activator-k4lld dataplane-probe Latencies     [min, mean, 50, 90, 95, 99, max]  100.75ms, 102.755ms, 102.38ms, 103.03ms, 103.249ms, 105.653ms, 1.31s
dataplane-probe-activator-k4lld dataplane-probe Bytes In      [total, mean]                     4299725, 23.89
dataplane-probe-activator-k4lld dataplane-probe Bytes Out     [total, mean]                     0, 0.00
dataplane-probe-activator-k4lld dataplane-probe Success       [ratio]                           100.00%
dataplane-probe-activator-k4lld dataplane-probe Status Codes  [code:count]                      200:180000  
dataplane-probe-activator-k4lld dataplane-probe Error Set:
dataplane-probe-activator-k4lld dataplane-probe 2023/09/01 08:16:47 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
dataplane-probe-activator-k4lld dataplane-probe 2023/09/01 08:16:47 Dataplane probe test finished
dataplane-probe-activator-k4lld dataplane-probe 2023/09/01 08:16:47 Shutting down InfluxReporter
dataplane-probe-activator-h8p9k dataplane-probe Requests      [total, rate, throughput]         180000, 1000.00, 999.44
dataplane-probe-activator-h8p9k dataplane-probe Duration      [total, attack, wait]             3m0s, 3m0s, 102.067ms
dataplane-probe-activator-h8p9k dataplane-probe Latencies     [min, mean, 50, 90, 95, 99, max]  100.779ms, 102.621ms, 102.367ms, 103.014ms, 103.229ms, 105.636ms, 1.342s
dataplane-probe-activator-h8p9k dataplane-probe Bytes In      [total, mean]                     4299927, 23.89
dataplane-probe-activator-h8p9k dataplane-probe Bytes Out     [total, mean]                     0, 0.00
dataplane-probe-activator-h8p9k dataplane-probe Success       [ratio]                           100.00%
dataplane-probe-activator-h8p9k dataplane-probe Status Codes  [code:count]                      200:180000  
dataplane-probe-activator-h8p9k dataplane-probe Error Set:
dataplane-probe-activator-h8p9k dataplane-probe 2023/09/01 08:16:47 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
dataplane-probe-activator-h8p9k dataplane-probe 2023/09/01 08:16:47 Dataplane probe test finished
dataplane-probe-activator-h8p9k dataplane-probe 2023/09/01 08:16:47 Shutting down InfluxReporter
dataplane-probe-activator-drcwb dataplane-probe Requests      [total, rate, throughput]         176977, 0.00, 0.00
dataplane-probe-activator-drcwb dataplane-probe Duration      [total, attack, wait]             0s, 0s, 0s
dataplane-probe-activator-drcwb dataplane-probe Latencies     [min, mean, 50, 90, 95, 99, max]  100.778ms, 0s, 0s, 0s, 0s, 0s, 1.312s
dataplane-probe-activator-drcwb dataplane-probe Bytes In      [total, mean]                     4227761, 0.00
dataplane-probe-activator-drcwb dataplane-probe Bytes Out     [total, mean]                     0, 0.00
dataplane-probe-activator-drcwb dataplane-probe Success       [ratio]                           0.00%
dataplane-probe-activator-drcwb dataplane-probe Status Codes  [code:count]                      200:176977  
dataplane-probe-activator-drcwb dataplane-probe Error Set:
dataplane-probe-activator-drcwb dataplane-probe 2023/09/01 08:16:47 Shutting down InfluxReporter
dataplane-probe-activator-drcwb dataplane-probe 2023/09/01 08:16:47 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 0s