logs/limits/dataplane-probe-activator-normal.log
{"level":"info","ts":1693553952.7724786,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/09/01 07:39:12 Starting dataplane probe for target: activator
Requests      [total, rate, throughput]         180000, 1000.01, 999.44
Duration      [total, attack, wait]             3m0s, 3m0s, 102.128ms
Latencies     [min, mean, 50, 90, 95, 99, max]  100.907ms, 102.626ms, 102.391ms, 103.057ms, 103.241ms, 104.747ms, 954.121ms
Bytes In      [total, mean]                     4299914, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:180000  
Error Set:
2023/09/01 07:42:13 SLA 1 passed. P95 latency is in 100000000-110000000ms time range
2023/09/01 07:42:13 Dataplane probe test finished
2023/09/01 07:42:13 Shutting down InfluxReporter